// - Створити довільний елемент с id = text. використовуючи JavaScript, зробіть так, щоб при кліку на кнопку зникавл елемент с id="text".


const text = document.querySelector('#text');
const btn = document.querySelector('.btn-1');

btn.onclick = () => {
    text.hidden === true ?
        text.hidden = false :
        text.hidden = true;

};



// Alternative

// btn.onclick = () => {
//     text.style.display === 'none' ?
//         text.style.display ='block':
//         text.style.display = 'none'
// };

console.log(text);
console.log(btn);


//     - Створіть кнопку, при кліку на яку, вона буде приховувати сама себе.

const hiddenBtn = document.querySelector('.btn-2');

hiddenBtn.onclick = () => {
  hiddenBtn.hidden = true;
};

// - Створити інпут який приймає вік людини та кнопку яка підтверджує дію.
//     При натисканні на кнопку зчитати інформацію з інпуту та перевірити вік чи менше він ніж 18, та повідомити про це користувача




// - Створіть меню, яке розгортається/згортається при клику
// - Створіть список коментарів , приклад об'єкту коментаря - {title : 'lorem', body:'lorem ipsum dolo sit ameti'}.
// Вивести список коментарів в документ, кожний в своєму блоці.
//     Додайте кожному коментарю по кнопці для згортання його body.
// - Створити 2 форми  по 2 інпути в кожній. створити кнопку при кліку на яку зчитується та виводиться на консоль інформація з цих 2х форм.
//     Кнопка повинна лежати за межами форм (Щоб уникнути  перезавантаження сторінки)
// Доступ до інпутів через Forms API. Отже дайте формі та інпутам всі необхідні атрибути.
// - Створити функцію, яка генерує таблицю.
//     Перший аргумент визначає кількість строк.
//     Другий параметр визначає кількість ячейок в кожній строці.
//     Третій параметр визначає елемент в який потрібно таблицю додати.
// - Напишіть «Карусель» – стрічку зображень, яку можна гортати вліво-вправо нажаттям на стрілочки.



